app/views/articles/show.html.erb

SELECT "topics".* FROM "topics" INNER JOIN "article_topics" ON "topics"."id" = "article_topics"."topic_id" WHERE "article_topics"."article_id" = ?  [["article_id", 10]]
---
  <h3>University <span id="articleDepartment"><%=@article.user.department.name %></span> Department</h3>
  <p>Topics: <span id="articleTopics"><% @article.topics.each do |topic| %>--<%= topic.name %><% end %></span> </p>