app/views/topics/index.html.erb

  	<p><%= topic.department.name%> Department</p>
  	<% topic.article_topics.each do |articletopic| %>
---
SELECT "article_topics".* FROM "article_topics" WHERE "article_topics"."topic_id" = ?  [["topic_id", 1]]
SELECT "topics".* FROM "topics"