app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    if params[:topic_id]
      @topic = Topic.find_by(id: params[:topic_id])
      @articles = @topic.articles
    else
      @articles = Article.all
      @article= Article.new
      @topics = Topic.all.collect {|topic| next if topic.department_id != current_user.department.id; topic}.compact

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "topics".* FROM "topics"
---
  def new
    @article= Article.new
    @topics = Topic.all.collect {|topic| next if topic.department_id != current_user.department.id; topic}.compact

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "topics".* FROM "topics"
---
  def edit
    if !can_edit?
      redirect_to "/"
    end
    @topics = Topic.all.collect {|topic| next if topic.department_id != @article.user.department.id; topic}.compact

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE 1=0
INSERT INTO "articles" ("name", "description", "link", "user_id") VALUES (?, ?, ?, ?)  [["name", "Test article"], ["description", "This study proves that article submission works"], ["link", "www.google.com"], ["user_id", 7]]
---
  def create
    @article = Article.new(article_params)
    @topics = Topic.all.collect {|topic| next if topic.department_id != current_user.department.id; topic}.compact
    respond_to do |format|
      if @article.save

UPDATE "articles" SET "description" = ?, "link" = ? WHERE "articles"."id" = ?  [["description", "54546546"], ["link", "546546546"], ["id", 10]]
---
  def update
    respond_to do |format|

      if @article.update(article_params)