app/controllers/topics_controller.rb

  def new
    @topic = Topic.new
    @article= Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
   	@topic = Topic.find_or_initialize_by(topic_params)
   	@article= Article.find_by_id(article_param[:article_id])
  	if @topic.save
  		@article.topics<< @topic
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "article_topics" ("article_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["topic_id", 53], ["created_at", "2017-10-17 00:03:24.063561"], ["updated_at", "2017-10-17 00:03:24.063561"]]
INSERT INTO "topics" ("name", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Space"], ["department_id", 1], ["created_at", "2017-10-16 22:42:59.891118"], ["updated_at", "2017-10-16 22:42:59.891118"]]